{
  "_name_or_path": "facebook/convnext-tiny-224",
  "architectures": [
    "ConvNextForImageClassification"
  ],
  "depths": [
    3,
    3,
    9,
    3
  ],
  "drop_path_rate": 0.0,
  "hidden_act": "gelu",
  "hidden_sizes": [
    96,
    192,
    384,
    768
  ],
  "id2label": {
    "0": "RiceLeafs_BrownSpot",
    "1": "RiceLeafs_Healthy",
    "2": "RiceLeafs_Hispa",
    "3": "RiceLeafs_LeafBlast"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "RiceLeafs_BrownSpot": 0,
    "RiceLeafs_Healthy": 1,
    "RiceLeafs_Hispa": 2,
    "RiceLeafs_LeafBlast": 3
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 1e-06,
  "model_type": "convnext",
  "num_channels": 3,
  "num_stages": 4,
  "patch_size": 4,
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.22.2"
}
